# ×. RaiseCOM（瑞斯康达）交换机常用配置命令

RaiseCOM（瑞斯康达）网络设备的命令格式与思科和锐捷的很接近，熟悉这两个厂商的人稍微学习一下应该就可以上手了。

## 0、常用查询命令

```

show running-config   # 查看设备当前配置信息
show version          # 查看系统版本
show access-list      # 查看ACL信息
show user table       # 查看设备的用户信息
show user active      # 查看登录到设备的用户信息
show user password expire # 查看密码有效期配置信息
show telnet-server    # 查看 Telnet Server 的配置情况
show privilege        # 查看当前用户等级信息
show clock            # 查看系统时间
show sntp             # 查看sntp配置信息
show ntp status       # 查看ntp配置信息
show ntp authentication # 查看ntp安全认证信息
show interface        # 查看接口状态信息
show interface brief  # 查看接口列表信息
show vlan             # 查看vlan信息
show ip interface brief # 查看三层接口的 IP 地址配置信息
show ip management-traffic # 查看 VLAN 接口下管理报文信息
show ip fib summary   # 查看路由转发表统计信息
show ip route         # 查看 IPv4 路由信息
show ip route protocol  # 查看路由表路由协议信息
show route-map        # 查看路由映射表配置信息
show ip ospf          # 查看 OSPF 基本信息
show isis interface   # 查看 ISIS 的接口信息
show ip bgp           # 查看本地 BGP 路由表的内容
show ip rip           # 查看 RIP 基本信息
show mls qos interface # 查看接口的 QoS 优先级、信任模式和调度模式信息
show service-policy interface # 查看已应用的流策略信息
show performance statistics interval buckets # 查看性能统计信息
show memory           # 查看内存信息
show cpu-utilization  # 查看CPU利用率
show logging          # 查看系统日志配置的相关信息
show logging buffer   # 查看系统日志缓冲区信息
show logging history  # 查看系统日志历史表信息
show alarm management # 查看当前告警参数配置信息
show alarm log        # 查看告警管理模块的配置信息
show alarm active     # 查看当前告警表信息
show alarm cleared    # 查看历史告警信息
show alarm            # 查看全局硬件环境监控告警配置信息
show alarm currrent   # 查看硬件环境监控当前告警信息
show alarm history    # 查看硬件环境监控历史告警信息
```

## 1、初始化配置

设备默认用户名：login：raisecom
设备默认用户名：password：raisecom

```undefined
Raisecom>enable

Password:raisecom

Raisecom#hostname hjz-gzf-syj-iscom2126

hjz-gzf-syj-iscom2126#user name raisecom password raisecom

hjz-gzf-syj-iscom2126#clock set 01 28 07 2022 09 10
```

## 2、交换机保护配置

```undefined
hjz-gzf-syj-iscom2126#config

hjz-gzf-syj-iscom2126(config)#spanning-tree disable

hjz-gzf-syj-iscom2126(config)#loopback-detection enable port-list 1-24

hjz-gzf-syj-iscom2126(config)#storm-control broadcast enable port 1-24

hjz-gzf-syj-iscom2126(config)#ip igmp snooping vlan-list 4000 immediate-leave
```

## 3、交换机端口配置

```undefined
hjz-gzf-syj-iscom2126(config)#create vlan 5,4000 active //创建VLAN并激活  hjz-gzf-syj-iscom2126(config)#interface range 1-24 //进入批量端口配置模式  hjz-gzf-syj-iscom2126(config-range)#switchport mode access //将端口设置为ACCESS模式 hjz-gzf-syj-iscom2126(config-range)#switchport access vlan 4000 //为端口打VLAN标记  hjz-gzf-syj-iscom2126(config-range)#switchport protect //开启端口保护  hjz-gzf-syj-iscom2126(config-range)#quit  hjz-gzf-syj-iscom2126(config)#interface range 25-26 //进入上联端口  hjz-gzf-syj-iscom2126(config-range)#description iscom2126ea-ma-pwr-25 //创建端口描述信息 hjz-gzf-syj-iscom2126(config-range)#switchport mode trunk //配置端口为TRUNK模式 hjz-gzf-syj-iscom2126(config-range)#switchport trunk allowed vlan 5,4000 confirm //允许透传VLAN5,4000 hjz-gzf-syj-iscom2126(config-range)#switchport trunk untagged vlan remove 1 //不透传VLAN 1 hjz-gzf-syj-iscom2126(config-range)#quit
```

## 4、交换机管理配置

```cobol
switchport trunk allowed vlan 5 hjz-gzf-syj-iscom2126(config)#interface ip 0  //配置交换机管理IP地址及对应的VLAN  hjz-gzf-syj-iscom2126(config-ip)#ip address 172.22.103.14 255.255.248.0 5 hjz-gzf-syj-iscom2126(config-ip)#quit //配置默认网关 hjz-gzf-syj-iscom2126(config)#ip default-gateway 172.22.103.254 hjz-gzf-syj-iscom2126(config)#quit //开启SNMP功能 hjz-gzf-syj-iscom2126(config)#snmp-server enable traps //设置团体名、其对应的视图和访问权 hjz-gzf-syj-iscom2126(config)#snmp-server community private view raisecomview rw hjz-gzf-syj-iscom2126(config)#snmp-server community public view raisecomview ro  //设置目标主机地址 hjz-gzf-syj-iscom2126(config)#snmp-server host 172.16.27.243 version 2c public hjz-gzf-syj-iscom2126(config)#snmp-server host 172.16.27.243 version 2c private  //设置SYSLOG功能 hjz-gzf-syj-iscom2126(config)#logging on hjz-gzf-syj-iscom2126(config)#logging host 172.16.27.243 local0 alerts 
```

## 5、保存配置并检查

```lua
hjz-gzf-syj-iscom2126#write  hjz-gzf-syj-iscom2126#show running-config  hjz-gzf-syj-iscom2126#show startup-config 
```

## 6、查看状态

```cobol
//查看MAC地址 hjz-gzf-syj-iscom2126(config)#show mac-address-table l2-address vlan 4000 | ex 25 hjz-gzf-syj-iscom2126(config)#show mac-address-table l2-address port 26  hjz-gzf-syj-iscom2126(config)#show interface ip //查看IP接口信息 hjz-gzf-syj-iscom2126(config)#show interface port //查看端口信息 //查看POE供电情况 hjz-gzf-syj-iscom2126(config)#show poe port-list 1-24 detail hjz-gzf-syj-iscom2126(config)#interface port 1  hjz-gzf-syj-iscom2126(config-port)#poe disable //关闭POE供电 hjz-gzf-syj-iscom2126(config-port)#poe enable //开启POE供电 hjz-gzf-syj-iscom2126(config-port)#shutdown hjz-gzf-syj-iscom2126(config-port)#no shutdown  hjz-gzf-syj-iscom2126(config-port)#quit
```

## 7、重启交换机

```csharp
hjz-gzf-syj-iscom2126#reboot now
```

## 8、删除配置

```csharp
hjz-gzf-syj-iscom2126#erase
```
